app/views/questions/show.html.erb

<% if @nextquestion %>
  <%= link_to 'Next Question', Question.find(@nextquestion.id) %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]