app/views/responses/list.html.erb

    <%= question.id %> : <%= question.question_text %>
      <% @a = question.responses.where(answer: '1').count %>
---
SELECT COUNT(*) FROM "responses" WHERE "responses"."question_id" = 1 AND "responses"."answer" = 1