app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def show
    @question = Question.find(params[:id])
    @nextquestion = @question.next
    @answers = Answer.where(:question_id => (@question.id))
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1

  def edit
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "question_text", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 21 Nov 2012 21:53:45 UTC +00:00], ["question_text", "testing"], ["updated_at", Wed, 21 Nov 2012 21:53:45 UTC +00:00]]

  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "questions" SET "correct_answer" = 3, "updated_at" = '2012-12-03 03:01:14.070940' WHERE "questions"."id" = 1

  def list
    @questions = Question.all
---
SELECT "questions".* FROM "questions"