app/controllers/responses_controller.rb

SELECT "responses".* FROM "responses"
SELECT "questions".* FROM "questions"
---
  def index
    @responses = Response.all
    @questions = Question.all

SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @response = Response.find(params[:id])

SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    @response = Response.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "responses".* FROM "responses" WHERE "responses"."user_id" = 1
INSERT INTO "responses" ("answer", "created_at", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["answer", 2], ["created_at", Mon, 26 Nov 2012 03:18:46 UTC +00:00], ["question_id", nil], ["updated_at", Mon, 26 Nov 2012 03:18:46 UTC +00:00], ["user_id", nil]]
---
  def create
    @user = User.find(session[:user_id])
    potential_response = Response.new(params[:response])
    question_id = potential_response.question.id
    count = 0

    @user.responses.each do |response|
      if response.question.id == question_id
        count += 1
      end
    end

    if count == 0
      @response = @user.responses.build(params[:response])
      respond_to do |format|
        if @response.save

SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "responses" SET "answer" = 4, "updated_at" = '2012-11-26 05:08:27.046724' WHERE "responses"."id" = 6
---
  def update
    @response = Response.find(params[:id])

    respond_to do |format|
      if @response.update_attributes(params[:response])

SELECT "responses".* FROM "responses"
SELECT "questions".* FROM "questions"
SELECT "users".* FROM "users"
SELECT "answers".* FROM "answers"
---
  def list
    @responses = Response.all
    @questions = Question.all
    @users = User.all
    @answers = Answer.all