app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def new
    @user = User.new
    if User.any?
---
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]